In [3]:
import pandas as pd

In [1]:
data = {'name': ['Somu', 'Kiku', 'Amol', 'Lini'],
    'physics': [68, 74, 77, 78],
    'chemistry': [84, 56, 73, 69],
    'algebra': [78, 88, 82, 87]}

In [4]:
data_df = pd.DataFrame(data)
data_df

   name  physics  chemistry  algebra
0  Somu       68         84       78
1  Kiku       74         56       88
2  Amol       77         73       82
3  Lini       78         69       87

In [6]:
for index, row in data_df.iterrows():
    print(index, row)

0 name         Somu
physics        68
chemistry      84
algebra        78
Name: 0, dtype: object
1 name         Kiku
physics        74
chemistry      56
algebra        88
Name: 1, dtype: object
2 name         Amol
physics        77
chemistry      73
algebra        82
Name: 2, dtype: object
3 name         Lini
physics        78
chemistry      69
algebra        87
Name: 3, dtype: object

In [9]:
for row in range(0,4):
    print(row)

0
1
2
3

In [11]:
data_df

   name  physics  chemistry  algebra
0  Somu       68         84       78
1  Kiku       74         56       88
2  Amol       77         73       82
3  Lini       78         69       87